#Задание_1

a = 'Введите два целых числа'                    # присваиваем переменной "а" текстовое значение
print(a)
a1 = int(input('Введите первое целое число:'))   # приводим переменные a1 и a2 к типу int
a2 = int(input('Введите второе целое число:'))
b = str(input('Введите строку:'))                # приводим переменную b к типу str
c = float(input('Введите дробное число:'))       # приводим переменную c к типу float
print(b, a1, a2, c)                              # выводим на экран значения переменных,введенные пользователем

#Задание_2

a = 4                 # переменная типа int
b = 3.5               # переменная типа float
c = True              # переменная типа bool
d = 'Hello, friends'  # переменная типа str

a = str(a)
b = str(b)



