# Задание 1
ann_apple = 2  # яблок у Анны
paul_apple = 5  # яблок у Пола
print('у Анны', ann_apple, 'яблока,''а у Пола', paul_apple, 'яблок.')

# Задание 2
a = 5  # длина ребра куба
V = a ** 3
S = 4 * a ** 2
print(V, S)

# Задание 3
snail_up = 2     # улитка ползет вверх, метров
snail_down = 1   # улитка ползет вниз,метров
tree = 20        # высота дерева
day = tree * (snail_up - snail_down)
print(day)
